app/controllers/api/v1/bmi_proxy_controller.rb

SELECT "patients".* FROM "patients" WHERE "patients"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def set_patient
        @patient = Patient.find(params[:patient_id])