app/controllers/api/v1/bmrs_controller.rb

INSERT INTO "bmr_results" ("patient_id", "formula", "value", "metadata", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
      def create
        formula = params.require(:formula)
        calculator = BmrCalculator.new(@patient)
        value = calculator.calculate(formula)
        bmr = @patient.bmr_results.create!(formula: formula, value: value,
                                           metadata: { weight: @patient.weight, height: @patient.height })

SELECT "patients".* FROM "patients" WHERE "patients"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
      def set_patient
        @patient = Patient.find(params[:patient_id])