app/controllers/api/v1/doctors_controller.rb

      def index
        limit = (params[:limit] || 20).to_i
        offset = (params[:offset] || 0).to_i
        doctors = Doctor.all
---
SELECT "doctors".* FROM "doctors"

      def create
        @doctor = Doctor.new(doctor_params)
        if @doctor.save
---
INSERT INTO "doctors" ("first_name", "last_name", "middle_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", "Иван"], ["last_name", "Петров"], ["middle_name", "Сергеевич"], ["created_at", "2025-09-27 21:08:56.318283"], ["updated_at", "2025-09-27 21:08:56.318283"]]