app/controllers/api/v1/patients_controller.rb

INSERT INTO "patients" ("first_name", "last_name", "middle_name", "birthday", "gender", "height", "weight", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
      def create
        @patient = Patient.new(patient_params)
        assign_doctors if params[:doctor_ids]

        if @patient.save